MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KM202/mcu.h
#define U2STA U2STA
extern volatile uint16_t U2STA __attribute__((__sfr__));
__extension__ typedef struct tagU2STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t :6;
      uint16_t TXINV:1;
    };
  };
} U2STABITS;
extern volatile U2STABITS U2STAbits __attribute__((__sfr__));

#define U2TXREG U2TXREG
extern volatile uint16_t U2TXREG __attribute__((__sfr__));
#define U2RXREG U2RXREG
extern volatile uint16_t U2RXREG __attribute__((__sfr__));
#define U2BRG U2BRG
extern volatile uint16_t U2BRG __attribute__((__sfr__));
#define AMP1CON AMP1CON
extern volatile uint16_t AMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagAMP1CONBITS {
  union {
    struct {
      uint16_t PINSEL:3;
      uint16_t NINSEL:3;
      uint16_t :1;
      uint16_t SPDSEL:1;
      uint16_t :4;
      uint16_t AMPSLP:1;
      uint16_t AMPSIDL:1;
      uint16_t :1;
      uint16_t AMPEN:1;
    };
    struct {
      uint16_t PINSEL0:1;
      uint16_t PINSEL1:1;
      uint16_t PINSEL2:1;
      uint16_t NINSEL0:1;
      uint16_t NINSEL1:1;
      uint16_t NINSEL2:1;
    };
  };
} AMP1CONBITS;
extern volatile AMP1CONBITS AMP1CONbits __attribute__((__sfr__));

#define AMP2CON AMP2CON
extern volatile uint16_t AMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagAMP2CONBITS {
  union {
    struct {
      uint16_t PINSEL:3;
      uint16_t NINSEL:3;
      uint16_t :1;
      uint16_t SPDSEL:1;
      uint16_t :4;
      uint16_t AMPSLP:1;
      uint16_t AMPSIDL:1;
      uint16_t :1;
      uint16_t AMPEN:1;
    };
    struct {
      uint16_t PINSEL0:1;
      uint16_t PINSEL1:1;
      uint16_t PINSEL2:1;
      uint16_t NINSEL0:1;
      uint16_t NINSEL1:1;
      uint16_t NINSEL2:1;
    };
  };
} AMP2CONBITS;
extern volatile AMP2CONBITS AMP2CONbits __attribute__((__sfr__));

#define DAC1CON DAC1CON
extern volatile uint16_t DAC1CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONBITS {
  union {
    struct {
      uint16_t DACREF:2;
      uint16_t DACTSEL:5;
      uint16_t DACOE:1;
      uint16_t DACTRIG:1;
      uint16_t SRDIS:1;
      uint16_t :1;
      uint16_t DACFM:1;
      uint16_t DACSLP:1;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t DACTSEL0:1;
      uint16_t DACTSEL1:1;
      uint16_t DACTSEL2:1;
      uint16_t DACTSEL3:1;
      uint16_t DACTSEL4:1;
    };
  };
} DAC1CONBITS;
extern volatile DAC1CONBITS DAC1CONbits __attribute__((__sfr__));

#define DAC1DAT DAC1DAT
extern volatile uint16_t DAC1DAT __attribute__((__sfr__));
#define DAC2CON DAC2CON
extern volatile uint16_t DAC2CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONBITS {
  union {
    struct {
      uint16_t DACREF:2;
      uint16_t DACTSEL:5;
      uint16_t DACOE:1;
      uint16_t DACTRIG:1;
      uint16_t SRDIS:1;
      uint16_t :1;
      uint16_t DACFM:1;
      uint16_t DACSLP:1;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t DACTSEL0:1;
      uint16_t DACTSEL1:1;
      uint16_t DACTSEL2:1;
      uint16_t DACTSEL3:1;
      uint16_t DACTSEL4:1;
    };
  };
} DAC2CONBITS;
extern volatile DAC2CONBITS DAC2CONbits __attribute__((__sfr__));

#define DAC2DAT DAC2DAT
extern volatile uint16_t DAC2DAT __attribute__((__sfr__));
#define TRISA TRISA
extern volatile uint16_t TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
  uint16_t :1;
  uint16_t TRISA6:1;
  uint16_t TRISA7:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
  uint16_t RA5:1;
  uint16_t RA6:1;
  uint16_t RA7:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
  uint16_t :1;
  uint16_t LATA6:1;
  uint16_t LATA7:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile uint16_t ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  uint16_t ODA0:1;
  uint16_t ODA1:1;
  uint16_t ODA2:1;
  uint16_t ODA3:1;
  uint16_t ODA4:1;
  uint16_t :1;
  uint16_t ODA6:1;
  uint16_t ODA7:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define TRISB TRISB
extern volatile uint16_t TRISB __attribute__((__sfr__));
typedef struct tagTRISBBITS {
  uint16_t TRISB0:1;
  uint16_t TRISB1:1;
  uint16_t TRISB2:1;
  uint16_t TRISB3:1;
  uint16_t TRISB4:1;
  uint16_t TRISB5:1;
  uint16_t TRISB6:1;
  uint16_t TRISB7:1;
  uint16_t TRISB8:1;
  uint16_t TRISB9:1;
  uint16_t TRISB10:1;
  uint16_t TRISB11:1;
  uint16_t TRISB12:1;
  uint16_t TRISB13:1;
  uint16_t TRISB14:1;
  uint16_t TRISB15:1;
} TRISBBITS;
extern volatile TRISBBITS TRISBbits __attribute__((__sfr__));

#define PORTB PORTB
extern volatile uint16_t PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  uint16_t RB0:1;
  uint16_t RB1:1;
  uint16_t RB2:1;
  uint16_t RB3:1;
  uint16_t RB4:1;
  uint16_t RB5:1;
  uint16_t RB6:1;
  uint16_t RB7:1;
  uint16_t RB8:1;
  uint16_t RB9:1;
  uint16_t RB10:1;
  uint16_t RB11:1;
  uint16_t RB12:1;
  uint16_t RB13:1;
  uint16_t RB14:1;
  uint16_t RB15:1;
} PORTBBITS;
