MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KM202/mcu.h
#define _SSP2CON1_SSPM3_POSITION                 0x00000003
#define _SSP2CON1_SSPM3_MASK                     0x00000008
#define _SSP2CON1_SSPM3_LENGTH                   0x00000001

#define _SSP2CON2_SEN_POSITION                   0x00000000
#define _SSP2CON2_SEN_MASK                       0x00000001
#define _SSP2CON2_SEN_LENGTH                     0x00000001

#define _SSP2CON2_RSEN_POSITION                  0x00000001
#define _SSP2CON2_RSEN_MASK                      0x00000002
#define _SSP2CON2_RSEN_LENGTH                    0x00000001

#define _SSP2CON2_PEN_POSITION                   0x00000002
#define _SSP2CON2_PEN_MASK                       0x00000004
#define _SSP2CON2_PEN_LENGTH                     0x00000001

#define _SSP2CON2_RCEN_POSITION                  0x00000003
#define _SSP2CON2_RCEN_MASK                      0x00000008
#define _SSP2CON2_RCEN_LENGTH                    0x00000001

#define _SSP2CON2_ACKEN_POSITION                 0x00000004
#define _SSP2CON2_ACKEN_MASK                     0x00000010
#define _SSP2CON2_ACKEN_LENGTH                   0x00000001

#define _SSP2CON2_ACKDT_POSITION                 0x00000005
#define _SSP2CON2_ACKDT_MASK                     0x00000020
#define _SSP2CON2_ACKDT_LENGTH                   0x00000001

#define _SSP2CON2_ACKSTAT_POSITION               0x00000006
#define _SSP2CON2_ACKSTAT_MASK                   0x00000040
#define _SSP2CON2_ACKSTAT_LENGTH                 0x00000001

#define _SSP2CON2_GCEN_POSITION                  0x00000007
#define _SSP2CON2_GCEN_MASK                      0x00000080
#define _SSP2CON2_GCEN_LENGTH                    0x00000001

#define _SSP2CON2_ADMSK_POSITION                 0x00000001
#define _SSP2CON2_ADMSK_MASK                     0x0000003E
#define _SSP2CON2_ADMSK_LENGTH                   0x00000005

#define _SSP2CON2_ADMSK1_POSITION                0x00000001
#define _SSP2CON2_ADMSK1_MASK                    0x00000002
#define _SSP2CON2_ADMSK1_LENGTH                  0x00000001

#define _SSP2CON2_ADMSK2_POSITION                0x00000002
#define _SSP2CON2_ADMSK2_MASK                    0x00000004
#define _SSP2CON2_ADMSK2_LENGTH                  0x00000001

#define _SSP2CON2_ADMSK3_POSITION                0x00000003
#define _SSP2CON2_ADMSK3_MASK                    0x00000008
#define _SSP2CON2_ADMSK3_LENGTH                  0x00000001

#define _SSP2CON2_ADMSK4_POSITION                0x00000004
#define _SSP2CON2_ADMSK4_MASK                    0x00000010
#define _SSP2CON2_ADMSK4_LENGTH                  0x00000001

#define _SSP2CON2_ADMSK5_POSITION                0x00000005
#define _SSP2CON2_ADMSK5_MASK                    0x00000020
#define _SSP2CON2_ADMSK5_LENGTH                  0x00000001

#define _SSP2CON3_DHEN_POSITION                  0x00000000
#define _SSP2CON3_DHEN_MASK                      0x00000001
#define _SSP2CON3_DHEN_LENGTH                    0x00000001

#define _SSP2CON3_AHEN_POSITION                  0x00000001
#define _SSP2CON3_AHEN_MASK                      0x00000002
#define _SSP2CON3_AHEN_LENGTH                    0x00000001

#define _SSP2CON3_SBCDE_POSITION                 0x00000002
#define _SSP2CON3_SBCDE_MASK                     0x00000004
#define _SSP2CON3_SBCDE_LENGTH                   0x00000001

#define _SSP2CON3_SDAHT_POSITION                 0x00000003
#define _SSP2CON3_SDAHT_MASK                     0x00000008
#define _SSP2CON3_SDAHT_LENGTH                   0x00000001

#define _SSP2CON3_BOEN_POSITION                  0x00000004
#define _SSP2CON3_BOEN_MASK                      0x00000010
#define _SSP2CON3_BOEN_LENGTH                    0x00000001

#define _SSP2CON3_SCIE_POSITION                  0x00000005
#define _SSP2CON3_SCIE_MASK                      0x00000020
#define _SSP2CON3_SCIE_LENGTH                    0x00000001

#define _SSP2CON3_PCIE_POSITION                  0x00000006
#define _SSP2CON3_PCIE_MASK                      0x00000040
#define _SSP2CON3_PCIE_LENGTH                    0x00000001

#define _SSP2CON3_ACKTIM_POSITION                0x00000007
#define _SSP2CON3_ACKTIM_MASK                    0x00000080
#define _SSP2CON3_ACKTIM_LENGTH                  0x00000001

#define _SSP2STAT_BF_POSITION                    0x00000000
#define _SSP2STAT_BF_MASK                        0x00000001
#define _SSP2STAT_BF_LENGTH                      0x00000001

#define _SSP2STAT_UA_POSITION                    0x00000001
#define _SSP2STAT_UA_MASK                        0x00000002
#define _SSP2STAT_UA_LENGTH                      0x00000001

#define _SSP2STAT_R_NOT_W_POSITION               0x00000002
#define _SSP2STAT_R_NOT_W_MASK                   0x00000004
#define _SSP2STAT_R_NOT_W_LENGTH                 0x00000001

#define _SSP2STAT_S_POSITION                     0x00000003
#define _SSP2STAT_S_MASK                         0x00000008
#define _SSP2STAT_S_LENGTH                       0x00000001

#define _SSP2STAT_P_POSITION                     0x00000004
#define _SSP2STAT_P_MASK                         0x00000010
#define _SSP2STAT_P_LENGTH                       0x00000001

#define _SSP2STAT_D_NOT_A_POSITION               0x00000005
#define _SSP2STAT_D_NOT_A_MASK                   0x00000020
#define _SSP2STAT_D_NOT_A_LENGTH                 0x00000001

#define _SSP2STAT_CKE_POSITION                   0x00000006
#define _SSP2STAT_CKE_MASK                       0x00000040
#define _SSP2STAT_CKE_LENGTH                     0x00000001

#define _SSP2STAT_SMP_POSITION                   0x00000007
#define _SSP2STAT_SMP_MASK                       0x00000080
#define _SSP2STAT_SMP_LENGTH                     0x00000001

#define _SSP2STAT_R_W_POSITION                   0x00000002
#define _SSP2STAT_R_W_MASK                       0x00000004
#define _SSP2STAT_R_W_LENGTH                     0x00000001

#define _SSP2STAT_D_A_POSITION                   0x00000005
#define _SSP2STAT_D_A_MASK                       0x00000020
#define _SSP2STAT_D_A_LENGTH                     0x00000001

#define _SSP2STAT_NOT_W_POSITION                 0x00000002
#define _SSP2STAT_NOT_W_MASK                     0x00000004
#define _SSP2STAT_NOT_W_LENGTH                   0x00000001

#define _SSP2STAT_NOT_A_POSITION                 0x00000005
#define _SSP2STAT_NOT_A_MASK                     0x00000020
#define _SSP2STAT_NOT_A_LENGTH                   0x00000001

#define _SSP2STAT_NOT_WRITE_POSITION             0x00000002
#define _SSP2STAT_NOT_WRITE_MASK                 0x00000004
#define _SSP2STAT_NOT_WRITE_LENGTH               0x00000001

#define _SSP2STAT_NOT_ADDRESS_POSITION           0x00000005
#define _SSP2STAT_NOT_ADDRESS_MASK               0x00000020
#define _SSP2STAT_NOT_ADDRESS_LENGTH             0x00000001

